
export const exercises = [
  {
    id: 1,
    name: "데드리프트",
    category: "등",
    thumbnail: "../assets/images/thumbnail1.png",   // 리스트용 썸네일
    video: "../assets/videos/video01.mp4",       // 상세용 영상
    desc: "몸 뒤쪽 근육들이 중량을 버티는 데에 많은 관여를 하기 때문에 등 근육 발달에 좋은 운동이에요. 완벽한 등근육을 가지고 싶다면 필수 운동!",
    startPos: [
      "바벨과 3cm 떨어진 곳에 정강이를 위치시켜 주세요.",
      "다리는 어깨너비만큼 벌려 주세요.",
      "무릎과 고관절을 굽혀 바벨을 어깨너비로 잡아주세요.",
      "가슴을 펴고 등과 하체에 긴장감을 유지해 주세요.",
    ],
    movement: [
      "뒤로 빠져있는 엉덩이가 앞으로 이동하면서 바벨을 들어 올려 주세요.",
      "바닥을 밀면서 발바닥 중심에 힘을 줍니다.",
      "완전히 일어났을 때 가슴을 펴면서 신체 후면 전체를 수축해 주세요.",
      "다시 엉덩이로부터 뒤로 빼고 무릎을 굽히면서 시작 자세로 돌아와 주세요.",
    ],
    breathing: [
      "상체를 올릴 때 숨을 내쉬고, 상체를 내릴 때 숨을 들이쉬세요.",
    ],
    cautions: [
      "어깨가 앞으로 굽지 않도록 가슴을 계속 펴주세요.",
      "허리가 말리지 않도록 코어에 힘을 주세요.",
    ]
  },
  {
    id: 2,
    name: "오버헤드 프레스",
    category: "어깨",
    thumbnail: "../assets/images/thumbnail2.png",
    video: "../assets/videos/video02.mp4",
    desc: "어깨 앞쪽 근육을 주로 쓰며 머리 위로 번쩍 들었을 때는 바벨과 몸이 일직선이 돼야 해요!",
    startPos: [
      "바벨이 쇄골 바로 위에 위치하게 해주세요.",
      "팔꿈치는 뒤로 빠지는 게 아니라 바벨보다 앞에 위치해야 합니다.",
      "가슴을 펴고 엉덩이에 힘을 주어 머리부터 발바닥까지 바로 선 자세를 유지해주세요.",
      "발 너비는 어깨너비로 유지합니다.",
    ],
    movement: [
      "바벨을 머리 위로 들어 올리세요. 내 몸 앞이 아닌, 머리 위로 들어 올려주세요.",
      "엉덩이와 코어에 힘을 준 채로 바벨을 천천히 내려 시작 자세로 돌아오세요.",
    ],
    breathing: [
      "팔을 올릴 때 숨을 내쉬고, 팔을 내릴 때 숨을 들이쉬세요.",
    ],
    cautions: [
      "바벨을 너무 넓게 잡으면 어깨에 무리가 갈 수 있으니 주의해주세요.",
      "엉덩이와 코어에 힘이 풀리면 허리에 무리가 갈 수 있으니 주의해주세요.",
      "동작 내내 상체 전체가 단단하게 유지되어야 합니다.",
    ]
  },
  {
  "id": 3,
  "name": "벤치 프레스",
  "category": "가슴",
  "thumbnail": "../assets/images/thumbnail3.png",
  "video": "../assets/videos/video03.mp4",
  "desc": "가슴 운동중 가장 많이 하는 운동이에요. 벤치프레스만 잘해도 크고 넓은 가슴을 가질 수 있어요!",
  "startPos": [
    "벤치에 누워 두 발을 바닥에 고정해주세요.",
    "어깨를 뒤로 당긴 후 고정하여 어깨가 가슴보다 뒤에 위치하게 합니다.",
    "허리는 자연스러운 아치 모양이 되게 해주세요.",
    "어깨너비보다 조금 넓게 바벨을 두 손으로 잡아주세요.",
    "허리와 어깨를 고정한 채로 바벨을 들어 바벨을 가슴 위에 위치하게 합니다."
  ],
  "movement": [
    "가슴 아래쪽에 바벨이 닿도록 천천히 바벨을 내려주세요.",
    "이때, 팔뚝(전완)은 바닥과 수직이 되어야 합니다.",
    "천천히 바벨을 들어 올려 시작 자세로 돌아오세요."
  ],
  "breathing": [
    "팔을 구부릴 때 숨을 들이쉬고, 팔을 밀 때 숨을 내쉬세요."
  ],
  "cautions": [
    "바벨이 가슴에 닿지 않으면 무리하지 않고 가능한 만큼만 내려주세요.",
    "어깨가 가슴보다 앞으로 오게 되면 어깨에 무리가 갈 수 있으니 주의해주세요.",
    "엉덩이가 벤치에서 떨어지지 않도록 주의해주세요."
  ]
},
{
  "id": 4,
  "name": "바벨 스쿼트",
  "category": "하체",
  "thumbnail": "../assets/images/thumbnail4.png",
  "video": "../assets/videos/video04.mp4",
  "desc": "하체 운동중 가장 대표적인 운동이에요. 하체를 기반으로 전신을 사용해서 운동해주세요!",
  "startPos": [
    "바벨을 어깨높이에 거치해 주세요.",
    "바벨을 어깨너비보다 넓게 잡고, 승모근에 올려주세요.",
    "다리는 어깨너비로 벌리고, 발끝은 20~30도 정도 벌려주세요.",
    "가슴을 펴고, 허리를 세워주세요."
  ],
  "movement": [
    "복부를 조이고, 허리를 단단히 세운 상태에서 고관절부터 접어서 엉덩이가 밑으로 내려가게 해주세요.",
    "자연스럽게 무릎이 접히면서 허벅지가 지면과 수평이 될 때까지 내려가 주세요.",
    "발바닥 중앙으로 강하게 밀면서 일어나 주세요.",
    "엉덩이가 올라가면서 무릎과 고관절을 차례로 펴고, 시작 자세로 돌아와 주세요."
  ],
  "breathing": [
    "내려갈 때 숨을 들이쉬고, 올라갈 때 숨을 내쉬세요."
  ],
  "cautions": [
    "과도하게 상체를 앞으로 숙이지 않도록 주의해주세요.",
    "허리가 꺾이지 않도록 가슴을 펴고, 코어에 힘을 주세요.",
    "허리를 세운다고 과도하게 꺾지 마세요.",
    "엉덩이를 너무 뒤로 빼지 말아 주세요.",
    "발이 지면에서 떨어지지 않도록 해주세요.",
    "일어날 때 무릎이 안으로 모이지 않도록 해주세요."
  ]
},
{
  "id": 5,
  "name": "싸이클",
  "category": "하체",
  "thumbnail": "../assets/images/thumbnail5.png",
  "video": "../assets/videos/video05.mp4",
  "desc": "대표적인 유산소 운동이에요. 숨이 지속적으로 차오를 수 있게 운동을 진행해 주세요!",
  "startPos": [
    "안장의 높이는 페달을 누른 다리가 완전히 펴지지 않고, 살짝 구부려질 수 있도록 조절해 주세요.",
    "어깨는 힘을 빼고, 허리는 일직선으로 곧게 유지한 상태에서 무게중심을 엉덩이에 두세요."
  ],
  "movement": [
    "안장의 높이는 페달을 누른 다리가 완전히 펴지지 않고 살짝 구부려질 수 있도록 조절합니다.",
    "어깨는 힘을 빼고 허리는 일직선으로 곧게 유지한 상태에서 무게중심을 뒤로 줍니다.",
    "페달을 밟을 때 무릎의 방향은 항상 일직선으로 하며 바깥쪽으로 벗어나지 않게 주의합니다.",
    "허벅지 근육을 키우기 위해서는 수직으로 내리는 힘에 집중하고 매끈한 다리를 위해서는 페달이 제일 밑에 가기 전에 당기는 힘을 줘 페달을 움직여야 합니다."
  ],
  "breathing": [
    "페달을 밟을 때 숨을 들이쉬고, 내릴 때 숨을 내쉬세요."
  ],
  "cautions": [
    "무릎이 벌어지거나 모이지 않도록 주의해주세요."
  ]
},
];
